"use strict"

// Математические операции можно производить не только над числами, но и над переменными. Сложим, к примеру, значения двух переменных:

// let a = 1;
// let b = 2;
// alert(a + b); // выведет 3

// Не обязательно сразу выводить результат операции, можно вначале записать его в какую нибудь переменную, а уже затем вывести значение этой переменной:

// let a = 1;
// let b = 2;
// let c = a + b; // запишем сумму в переменную c
// alert(c);      // выведет 3

// Задача 1

// Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

// сумма
// let a = 10;
// let b = 2;
// let c = a + b;
// alert(c) //12

//разность
// let a = 10;
// let b = 2;
// let c = a - b;
// alert(c) //8

// произведение
// let a = 10;
// let b = 2
// let c = a * b;
// alert(c) // выведет 20

// частное
// let a = 10;
// let b = 2;
// let c = a / b;
// alert(c) // выведет 5

// Задача 2

// Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

// let c = 10;
// let d = 5;
// let result = c + d;
// alert(result)


// Задача 3

// Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.

// let a = 1;
// let b = 2;
// let c = 3;

// let result = a + b + c;
// alert(result)



// Задача 4

// Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

// Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.


// let a = 10;
// let b = 5;

// let c = a - b;
// alert(c)

// let d = 7;

// let result = c + d;
// alert(result)


// задача 5
// let a = 20;
// let b = 2;
// let c = 20 + 2;
// alert(c) 22


// let a = 20;
// let b = 2;
// let c = 20 - 2;
// alert(c) 18


// let a = 20;
// let b = 2;
// let c = 20 * 2;
// alert(c) 40


// let a = 20;
// let b = 2;
// let c = 20 / 2;
// alert(c) 10


// ЗAДАЧА 6 
// let c = 20;
// let d = 5;
// let result = c + d;
// alert(result) 25


// ЗАДАЧА 7 
// let a = 4;
// let b = 8;
// let c = 10;
// let result = a + b + c;
// alert(result) 22

// ЗАДАЧА 8

let a = 10;
let b = 2;
let c = a - b;
alert(c)

let d = 8;
let result = c + d;
alert(result)