// Сложение строк в JavaScript

// Задача 1
// Создайте переменную str и присвойте ей строку '!!!'. Выведите значение этой переменной на экран.
// let str = '!!!'
// alert(str)

// Задача 2⋕
// Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.

// let lang = 'java'
// let lang1 = 'script'
// alert(lang+lang1)

// Задача 3

// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.

let a = 'hello'
let b = 'world'
alert(a + ' ' + b)
// выведет hello world