'use strict' // строгий режим

//Zadacha 1
//  Пусть дана переменная r с радиусом круга. По соответствующей формуле найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
// let r = 10;
// let s = 3.1415 * r **2;
// alert(s); // 314.15000000000003

//Zadacha 2 
// Пусть дана переменная a со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
// let a  = 10;
// let s = a ** 2;
// console.log(s) //100

//Zadacha 3 
// Пусть даны переменные a и b со сторонами прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
// let a = 12;
// let b = 8;
// let s = a*b;
// console.log(s) // 96

//Zadacha 4
//  Пусть даны переменные a и b со сторонами прямоугольника. Найдите периметр прямоугольника и запишите его в переменную p. Выведите содержимое этой переменной на экран.
// let a = 12;
// let b = 8;
// let p = (a + b) * 2;
// console.log(p)

// Zadacha 5 
// Пусть дана переменная tc с температурой в градусах Цельсия. По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
// let tc = 30;
// let result = tc * 9 / 5 + 32;
// console.log(result); //86

//Zadacha 6
//  Пусть дана переменная tf с температурой в градусах Фаренгейта. По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.
let tf = 100;
let result = tf - 32 * 9 / 5;
console.log(result); //  42.4
