// Задача 1
// Не запуская код, определите, что выведется на экран:
alert(true + 3); //выведет 4


// Задача 2
// Не запуская код, определите, что выведется на экран:
alert(true + true); // выведет 2


// Задача 3
// Не запуская код, определите, что выведется на экран:
alert(true - true); // выведет 0


// Задача 4
// Не запуская код, определите, что выведется на экран:
alert(true + false); // выведет 1

// Задача 5
// Не запуская код, определите, что выведется на экран:
alert('1' + true); // выведет 1true

// Задача 6
// Не запуская код, определите, что выведется на экран:
alert( String(true) + 1 ); //выведет true1

// Задача 7
// Не запуская код, определите, что выведется на экран:
alert( String(true) + Number(true) ); // выведет true1

//Задача 8
alert(String(false) + Number(true))// выведет false1

//Задача 9
alert(Number(false) + Number(false)) // выведет 0