// Отрицательные числа в JavaScript
// Числа могут быть отрицательными. Для этого перед числом необходимо поставить знак минус:

// let a = -1;
// alert(a); // выведет -1
// Знак минус можно писать как к числам, так и к переменным:

// let a = 1;
// let b = -a; // записали в b содержимое a с обратным знаком
// alert(b);   // выведет -1
// Или вот так:

// let a = 1;
// alert(-a); // выведет -1

						// Задача 1

// Создайте переменную a со значением -100. Выведите это значение на экран.

// let a = 100
// alert(-a) //выведет -100

// Задача 2

// Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.

// let a = 245
// alert(-a) // выведет -245

// Плюс перед переменными

// Подобно тому, как перед отрицательными числами ставится знак "минус", перед положительными числами можно ставить знак "плюс".

// Фактически этот плюс ничего не делает, но вполне является допустимым, смотрите пример:

let a = +1;
alert(a); // выведет 1