// Сложение:

// let a = 1 + 2;
// alert(a); // выведет 3

// Вычитание:

// let b = 3 - 2;
// alert(b); // выведет 1

// Умножение:

// let c = 3 * 2;
// alert(c); // выведет 6

// Деление:

// let d = 4 / 2;
// alert(d); // выведет 2

// Задача 1

// Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

// Задача 1

// Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

// let a = 1 + 2 + 3; //выведет 6
// alert(a)

// let a = 1 - 2 - 3; // выведет - 4 
// alert(a) 

// let a = 1 * 2 * 3; //выведет - 6
// alert(a)

// let a = 1 / 2 / 3; // выведет - 0.166
// alert(a)