'use strict' //включен строгий режим

//Zadacha 1 Найдите количество секунд в сутках.
console.log(60 * 60 * 24) //86400

//Zadacha 2 Найдите количество секунд в 30 сутках.
console.log(60 * 60 * 24 * 30) // 2592000

//Zadacha 3 Найдите количество секунд в году.
console.log(60 * 60 * 24 * 365.25) //31557600

//Zadacha 4 Найдите количество минут в сутках.
console.log(60 * 24) // 1440

//Zadacha 5 Найдите количество минут в году.
console.log(60 * 24 * 365.25)  // 525960

// Zadacha 6 Найдите количество байт в мегабайте.
console.log(1024 ** 2) // 1048576

//Zadacha 7 Найдите количество байт в гигабайте
console.log(1024 ** 3) // 1073741824

//Zadacha 8 Найдите количество байт в 10 гигабайтах.
console.log(1024 ** 3 * 10) // 10737418240

//Zadacha 9 Найдите количество байт в терабайте.
console.log(1024 ** 4 ) //1099511627776

//Zadacha 10 Найдите количество килобайт в терабайте.
console.log(1024 ** 3) // 1073741824