// Остаток от деления в JavaScript
// Существует специальный оператор %, с помощью которого можно найти остаток от деления одного числа на другое:

// alert(10 % 3); // выведет 1
// Если одно число делится нацело на второе - остаток будет равен нулю:

// alert(10 % 2); // выведет 0
// Оператор %, конечно же, можно применять не только к числам, но и к переменным:

// let a = 10;
// let b = 3;
// alert(a % b); // выведет 1

// Задача 1

// Найдите остаток от деления следующих переменных:

let a = 13;
let b = 5;
alert(a % b)
// будет 3