/* В следующем примере вначале 2 умножится на 2 и затем к результату прибавится 3: */

// let a = 2 * 2 + 3;
// alert(a); 
//выведет 7 (результат 4 + 3)


// Задача 1
// let a = 5 + 5 * 3;
// alert(a);
// выведет 20 (результат 15+5)


// Задача 2
// let a = 5 + 5 * 3 + 3;
// alert(a);
// выведет 23 (15+5+3)


// Задача 3
// let a = 8 / 2 + 2;
// alert(a);
// выведет 6 (4+2)


// Задача 4
// let a = 8 + 2 / 2;
// alert(a);
// выведет 9 (1+8)

// Равный приоритет

// Задача 5
// Не запуская код, определите, что выведется на экран:
// let a = 8 / 2 * 2;
// alert(a);
// выведет 8 (4*2)

// Задача 6
// let a = 8 * 4 / 2 / 2;
// alert(a);
// выведет 8 (32/2/2)


// Группирующие скобки


// Задача 7
// Не запуская код, определите, что выведется на экран:
// let a = (2 + 3) * (2 + 3);
// alert(a);
// выведет 36 (6*6)

// Задача 8
// Не запуская код, определите, что выведется на экран:
// let a = (2 + 3) * 2 + 3;
// alert(a);
// 15 (5*2+3)

// Задача 9
// let a = 2 * (2 + 4 * (3 + 1));
// alert(a);
// выведет 36 (4*4+2)*2

// Задача 10
// let a = 2 * 8 / 4;
// alert(a);
// выведт 4 (16/4)

// Задача 11
// let a = (2 * 8) / 4;
// alert(a);
// выдает 4 (16/4)

// Задача 12
let a = 2 * (8 / 4);
alert(a);
// получается 4 (2*2)